"""
copyright 2025 miuruwa
"""


VK_CHAT_NOTIFICATION = """
СОЛНЫШКИ МОИ!! (￢‿￢ )
В группе новый пост @all
"""

TELEGRAM_CHANNEL_NOTIFICATION = """
📢 Зайки, внимание! °˖✧◝(⁰▿⁰)◜✧˖°

{post_link}
"""

TELEGRAM_CHANNEL_NOTIFICATION_DONUT = """
🍩 Внимание, солнышки!
Для вас, самых самых, у меня есть новый пост:

↘️{post_link}
"""

X_POST_EDIT_NOTIFY = """
Вам необходимо проверить текст следующего поста для отправки в X
"""

X_POST_EDIT_SUGGESTION = """
Выберите действие:
"""

X_POST_EDIT_AWAIT = """
Предложите новый текст к посту
"""

X_POST_EDIT_SUCCESS = "Пост отправлен с новым текстом"
X_POST_EDIT_CANCEL = "Пост отправлен с оригинальный текстом"

X_POST_KEYBOARD_YES = "Изменить"
X_POST_KEYBOARD_NO = "Оставить"
X_POST_KEYBOARD_CANCEL = "Отправить оригинальный текст"

SUCCESS_REPOST = """
Отправлено сообщение из {post_original}
Текст сообщения: {post_text}
"""

EXCEPTION_MESSAGE = """
В ходе выполнения команды вышло исключение: {exception}
"""
