"""
Copyright 2023 kensoi
"""


VK_CHAT_NOTIFICATION = """
СОЛНЫШКИ МОИ!! (￢‿￢ )
В группе новый пост @all
"""

TELEGRAM_CHANNEL_NOTIFICATION = """
📢 Зайки, внимание! °˖✧◝(⁰▿⁰)◜✧˖°

{post_link}
"""

TELEGRAM_CHANNEL_NOTIFICATION_DONUT = """
🍩 Внимание, солнышки!
Для вас, самых самых, у меня есть новый пост:

↘️{post_link}
"""

SUCCESS_REPOST = """
Отправлено сообщение из {post_original}
Текст сообщения: {post_text}
"""

EXCEPTION_MESSAGE = """
В ходе выполнения команды вышло исключение: {exception}
"""
